liyugoodboy/serialFlashProgrammer/SciFlashAppCpu1_TMS320F28379D/library/driverlib/inc/hw_outputxbar.h
//*****************************************************************************
//
// The following are defines for the bit fields in the OUTPUT6MUX16TO31CFG register
//
//*****************************************************************************
#define XBAR_OUTPUT6MUX16TO31CFG_MUX16_S  0U
#define XBAR_OUTPUT6MUX16TO31CFG_MUX16_M  0x3U         // Mux16 Configuration for
                                               // OUTPUT6 of OUTPUT-XBAR
#define XBAR_OUTPUT6MUX16TO31CFG_MUX17_S  2U
#define XBAR_OUTPUT6MUX16TO31CFG_MUX17_M  0xCU         // Mux17 Configuration for
                                               // OUTPUT6 of OUTPUT-XBAR
#define XBAR_OUTPUT6MUX16TO31CFG_MUX18_S  4U
#define XBAR_OUTPUT6MUX16TO31CFG_MUX18_M  0x30U        // Mux18 Configuration for
                                               // OUTPUT6 of OUTPUT-XBAR
#define XBAR_OUTPUT6MUX16TO31CFG_MUX19_S  6U
#define XBAR_OUTPUT6MUX16TO31CFG_MUX19_M  0xC0U        // Mux19 Configuration for
                                               // OUTPUT6 of OUTPUT-XBAR
#define XBAR_OUTPUT6MUX16TO31CFG_MUX20_S  8U
#define XBAR_OUTPUT6MUX16TO31CFG_MUX20_M  0x300U       // Mux20 Configuration for
                                               // OUTPUT6 of OUTPUT-XBAR
#define XBAR_OUTPUT6MUX16TO31CFG_MUX21_S  10U
#define XBAR_OUTPUT6MUX16TO31CFG_MUX21_M  0xC00U       // Mux21 Configuration for
                                               // OUTPUT6 of OUTPUT-XBAR
#define XBAR_OUTPUT6MUX16TO31CFG_MUX22_S  12U
#define XBAR_OUTPUT6MUX16TO31CFG_MUX22_M  0x3000U      // Mux22 Configuration for
                                               // OUTPUT6 of OUTPUT-XBAR
#define XBAR_OUTPUT6MUX16TO31CFG_MUX23_S  14U
#define XBAR_OUTPUT6MUX16TO31CFG_MUX23_M  0xC000U      // Mux23 Configuration for
                                               // OUTPUT6 of OUTPUT-XBAR
#define XBAR_OUTPUT6MUX16TO31CFG_MUX24_S  16U
#define XBAR_OUTPUT6MUX16TO31CFG_MUX24_M  0x30000U     // Mux24 Configuration for
                                               // OUTPUT6 of OUTPUT-XBAR
#define XBAR_OUTPUT6MUX16TO31CFG_MUX25_S  18U
#define XBAR_OUTPUT6MUX16TO31CFG_MUX25_M  0xC0000U     // Mux25 Configuration for
                                               // OUTPUT6 of OUTPUT-XBAR
#define XBAR_OUTPUT6MUX16TO31CFG_MUX26_S  20U
#define XBAR_OUTPUT6MUX16TO31CFG_MUX26_M  0x300000U    // Mux26 Configuration for
                                               // OUTPUT6 of OUTPUT-XBAR
#define XBAR_OUTPUT6MUX16TO31CFG_MUX27_S  22U
#define XBAR_OUTPUT6MUX16TO31CFG_MUX27_M  0xC00000U    // Mux27 Configuration for
                                               // OUTPUT6 of OUTPUT-XBAR
#define XBAR_OUTPUT6MUX16TO31CFG_MUX28_S  24U
#define XBAR_OUTPUT6MUX16TO31CFG_MUX28_M  0x3000000U   // Mux28 Configuration for
                                               // OUTPUT6 of OUTPUT-XBAR
#define XBAR_OUTPUT6MUX16TO31CFG_MUX29_S  26U
#define XBAR_OUTPUT6MUX16TO31CFG_MUX29_M  0xC000000U   // Mux29 Configuration for
                                               // OUTPUT6 of OUTPUT-XBAR
#define XBAR_OUTPUT6MUX16TO31CFG_MUX30_S  28U
#define XBAR_OUTPUT6MUX16TO31CFG_MUX30_M  0x30000000U  // Mux30 Configuration for
                                               // OUTPUT6 of OUTPUT-XBAR
#define XBAR_OUTPUT6MUX16TO31CFG_MUX31_S  30U
#define XBAR_OUTPUT6MUX16TO31CFG_MUX31_M  0xC0000000U  // Mux31 Configuration for
                                               // OUTPUT6 of OUTPUT-XBAR

//*****************************************************************************
//
// The following are defines for the bit fields in the OUTPUT7MUX0TO15CFG register
//
//*****************************************************************************
#define XBAR_OUTPUT7MUX0TO15CFG_MUX0_S  0U
#define XBAR_OUTPUT7MUX0TO15CFG_MUX0_M  0x3U         // Mux0 Configuration for
                                               // OUTPUT7 of OUTPUT-XBAR
#define XBAR_OUTPUT7MUX0TO15CFG_MUX1_S  2U
#define XBAR_OUTPUT7MUX0TO15CFG_MUX1_M  0xCU         // Mux1 Configuration for
                                               // OUTPUT7 of OUTPUT-XBAR
#define XBAR_OUTPUT7MUX0TO15CFG_MUX2_S  4U
#define XBAR_OUTPUT7MUX0TO15CFG_MUX2_M  0x30U        // Mux2 Configuration for
                                               // OUTPUT7 of OUTPUT-XBAR
#define XBAR_OUTPUT7MUX0TO15CFG_MUX3_S  6U
#define XBAR_OUTPUT7MUX0TO15CFG_MUX3_M  0xC0U        // Mux3 Configuration for
                                               // OUTPUT7 of OUTPUT-XBAR
#define XBAR_OUTPUT7MUX0TO15CFG_MUX4_S  8U
#define XBAR_OUTPUT7MUX0TO15CFG_MUX4_M  0x300U       // Mux4 Configuration for
                                               // OUTPUT7 of OUTPUT-XBAR
#define XBAR_OUTPUT7MUX0TO15CFG_MUX5_S  10U
#define XBAR_OUTPUT7MUX0TO15CFG_MUX5_M  0xC00U       // Mux5 Configuration for
                                               // OUTPUT7 of OUTPUT-XBAR
#define XBAR_OUTPUT7MUX0TO15CFG_MUX6_S  12U
#define XBAR_OUTPUT7MUX0TO15CFG_MUX6_M  0x3000U      // Mux6 Configuration for
                                               // OUTPUT7 of OUTPUT-XBAR
#define XBAR_OUTPUT7MUX0TO15CFG_MUX7_S  14U
#define XBAR_OUTPUT7MUX0TO15CFG_MUX7_M  0xC000U      // Mux7 Configuration for
                                               // OUTPUT7 of OUTPUT-XBAR
#define XBAR_OUTPUT7MUX0TO15CFG_MUX8_S  16U
#define XBAR_OUTPUT7MUX0TO15CFG_MUX8_M  0x30000U     // Mux8 Configuration for
                                               // OUTPUT7 of OUTPUT-XBAR
#define XBAR_OUTPUT7MUX0TO15CFG_MUX9_S  18U
#define XBAR_OUTPUT7MUX0TO15CFG_MUX9_M  0xC0000U     // Mux9 Configuration for
                                               // OUTPUT7 of OUTPUT-XBAR
#define XBAR_OUTPUT7MUX0TO15CFG_MUX10_S  20U
#define XBAR_OUTPUT7MUX0TO15CFG_MUX10_M  0x300000U    // Mux10 Configuration for
                                               // OUTPUT7 of OUTPUT-XBAR
#define XBAR_OUTPUT7MUX0TO15CFG_MUX11_S  22U
#define XBAR_OUTPUT7MUX0TO15CFG_MUX11_M  0xC00000U    // Mux11 Configuration for
                                               // OUTPUT7 of OUTPUT-XBAR
#define XBAR_OUTPUT7MUX0TO15CFG_MUX12_S  24U
#define XBAR_OUTPUT7MUX0TO15CFG_MUX12_M  0x3000000U   // Mux12 Configuration for
                                               // OUTPUT7 of OUTPUT-XBAR
#define XBAR_OUTPUT7MUX0TO15CFG_MUX13_S  26U
#define XBAR_OUTPUT7MUX0TO15CFG_MUX13_M  0xC000000U   // Mux13 Configuration for
                                               // OUTPUT7 of OUTPUT-XBAR
#define XBAR_OUTPUT7MUX0TO15CFG_MUX14_S  28U
#define XBAR_OUTPUT7MUX0TO15CFG_MUX14_M  0x30000000U  // Mux14 Configuration for
                                               // OUTPUT7 of OUTPUT-XBAR
#define XBAR_OUTPUT7MUX0TO15CFG_MUX15_S  30U
#define XBAR_OUTPUT7MUX0TO15CFG_MUX15_M  0xC0000000U  // Mux15 Configuration for
                                               // OUTPUT7 of OUTPUT-XBAR

//*****************************************************************************
//
// The following are defines for the bit fields in the OUTPUT7MUX16TO31CFG register
//
//*****************************************************************************
#define XBAR_OUTPUT7MUX16TO31CFG_MUX16_S  0U
#define XBAR_OUTPUT7MUX16TO31CFG_MUX16_M  0x3U         // Mux16 Configuration for
                                               // OUTPUT7 of OUTPUT-XBAR
#define XBAR_OUTPUT7MUX16TO31CFG_MUX17_S  2U
#define XBAR_OUTPUT7MUX16TO31CFG_MUX17_M  0xCU         // Mux17 Configuration for
                                               // OUTPUT7 of OUTPUT-XBAR
#define XBAR_OUTPUT7MUX16TO31CFG_MUX18_S  4U
#define XBAR_OUTPUT7MUX16TO31CFG_MUX18_M  0x30U        // Mux18 Configuration for
                                               // OUTPUT7 of OUTPUT-XBAR
#define XBAR_OUTPUT7MUX16TO31CFG_MUX19_S  6U
#define XBAR_OUTPUT7MUX16TO31CFG_MUX19_M  0xC0U        // Mux19 Configuration for
                                               // OUTPUT7 of OUTPUT-XBAR
#define XBAR_OUTPUT7MUX16TO31CFG_MUX20_S  8U
#define XBAR_OUTPUT7MUX16TO31CFG_MUX20_M  0x300U       // Mux20 Configuration for
                                               // OUTPUT7 of OUTPUT-XBAR
#define XBAR_OUTPUT7MUX16TO31CFG_MUX21_S  10U
#define XBAR_OUTPUT7MUX16TO31CFG_MUX21_M  0xC00U       // Mux21 Configuration for
                                               // OUTPUT7 of OUTPUT-XBAR
#define XBAR_OUTPUT7MUX16TO31CFG_MUX22_S  12U
#define XBAR_OUTPUT7MUX16TO31CFG_MUX22_M  0x3000U      // Mux22 Configuration for
                                               // OUTPUT7 of OUTPUT-XBAR
#define XBAR_OUTPUT7MUX16TO31CFG_MUX23_S  14U
#define XBAR_OUTPUT7MUX16TO31CFG_MUX23_M  0xC000U      // Mux23 Configuration for
                                               // OUTPUT7 of OUTPUT-XBAR
#define XBAR_OUTPUT7MUX16TO31CFG_MUX24_S  16U
#define XBAR_OUTPUT7MUX16TO31CFG_MUX24_M  0x30000U     // Mux24 Configuration for
                                               // OUTPUT7 of OUTPUT-XBAR
#define XBAR_OUTPUT7MUX16TO31CFG_MUX25_S  18U
#define XBAR_OUTPUT7MUX16TO31CFG_MUX25_M  0xC0000U     // Mux25 Configuration for
                                               // OUTPUT7 of OUTPUT-XBAR
#define XBAR_OUTPUT7MUX16TO31CFG_MUX26_S  20U
#define XBAR_OUTPUT7MUX16TO31CFG_MUX26_M  0x300000U    // Mux26 Configuration for
                                               // OUTPUT7 of OUTPUT-XBAR
#define XBAR_OUTPUT7MUX16TO31CFG_MUX27_S  22U
#define XBAR_OUTPUT7MUX16TO31CFG_MUX27_M  0xC00000U    // Mux27 Configuration for
                                               // OUTPUT7 of OUTPUT-XBAR
#define XBAR_OUTPUT7MUX16TO31CFG_MUX28_S  24U
#define XBAR_OUTPUT7MUX16TO31CFG_MUX28_M  0x3000000U   // Mux28 Configuration for
                                               // OUTPUT7 of OUTPUT-XBAR
#define XBAR_OUTPUT7MUX16TO31CFG_MUX29_S  26U
#define XBAR_OUTPUT7MUX16TO31CFG_MUX29_M  0xC000000U   // Mux29 Configuration for
                                               // OUTPUT7 of OUTPUT-XBAR
#define XBAR_OUTPUT7MUX16TO31CFG_MUX30_S  28U
#define XBAR_OUTPUT7MUX16TO31CFG_MUX30_M  0x30000000U  // Mux30 Configuration for
                                               // OUTPUT7 of OUTPUT-XBAR
#define XBAR_OUTPUT7MUX16TO31CFG_MUX31_S  30U
#define XBAR_OUTPUT7MUX16TO31CFG_MUX31_M  0xC0000000U  // Mux31 Configuration for
                                               // OUTPUT7 of OUTPUT-XBAR

//*****************************************************************************
//
// The following are defines for the bit fields in the OUTPUT8MUX0TO15CFG register
//
//*****************************************************************************
#define XBAR_OUTPUT8MUX0TO15CFG_MUX0_S  0U
#define XBAR_OUTPUT8MUX0TO15CFG_MUX0_M  0x3U         // Mux0 Configuration for
                                               // OUTPUT8 of OUTPUT-XBAR
#define XBAR_OUTPUT8MUX0TO15CFG_MUX1_S  2U
#define XBAR_OUTPUT8MUX0TO15CFG_MUX1_M  0xCU         // Mux1 Configuration for
                                               // OUTPUT8 of OUTPUT-XBAR
#define XBAR_OUTPUT8MUX0TO15CFG_MUX2_S  4U
#define XBAR_OUTPUT8MUX0TO15CFG_MUX2_M  0x30U        // Mux2 Configuration for
                                               // OUTPUT8 of OUTPUT-XBAR
#define XBAR_OUTPUT8MUX0TO15CFG_MUX3_S  6U
#define XBAR_OUTPUT8MUX0TO15CFG_MUX3_M  0xC0U        // Mux3 Configuration for
                                               // OUTPUT8 of OUTPUT-XBAR
#define XBAR_OUTPUT8MUX0TO15CFG_MUX4_S  8U
#define XBAR_OUTPUT8MUX0TO15CFG_MUX4_M  0x300U       // Mux4 Configuration for
                                               // OUTPUT8 of OUTPUT-XBAR
#define XBAR_OUTPUT8MUX0TO15CFG_MUX5_S  10U
#define XBAR_OUTPUT8MUX0TO15CFG_MUX5_M  0xC00U       // Mux5 Configuration for
                                               // OUTPUT8 of OUTPUT-XBAR
#define XBAR_OUTPUT8MUX0TO15CFG_MUX6_S  12U
#define XBAR_OUTPUT8MUX0TO15CFG_MUX6_M  0x3000U      // Mux6 Configuration for
                                               // OUTPUT8 of OUTPUT-XBAR
#define XBAR_OUTPUT8MUX0TO15CFG_MUX7_S  14U
#define XBAR_OUTPUT8MUX0TO15CFG_MUX7_M  0xC000U      // Mux7 Configuration for
                                               // OUTPUT8 of OUTPUT-XBAR
#define XBAR_OUTPUT8MUX0TO15CFG_MUX8_S  16U
#define XBAR_OUTPUT8MUX0TO15CFG_MUX8_M  0x30000U     // Mux8 Configuration for
                                               // OUTPUT8 of OUTPUT-XBAR
#define XBAR_OUTPUT8MUX0TO15CFG_MUX9_S  18U
#define XBAR_OUTPUT8MUX0TO15CFG_MUX9_M  0xC0000U     // Mux9 Configuration for
                                               // OUTPUT8 of OUTPUT-XBAR
#define XBAR_OUTPUT8MUX0TO15CFG_MUX10_S  20U
#define XBAR_OUTPUT8MUX0TO15CFG_MUX10_M  0x300000U    // Mux10 Configuration for
                                               // OUTPUT8 of OUTPUT-XBAR
#define XBAR_OUTPUT8MUX0TO15CFG_MUX11_S  22U
#define XBAR_OUTPUT8MUX0TO15CFG_MUX11_M  0xC00000U    // Mux11 Configuration for
                                               // OUTPUT8 of OUTPUT-XBAR
#define XBAR_OUTPUT8MUX0TO15CFG_MUX12_S  24U
#define XBAR_OUTPUT8MUX0TO15CFG_MUX12_M  0x3000000U   // Mux12 Configuration for
                                               // OUTPUT8 of OUTPUT-XBAR
#define XBAR_OUTPUT8MUX0TO15CFG_MUX13_S  26U
#define XBAR_OUTPUT8MUX0TO15CFG_MUX13_M  0xC000000U   // Mux13 Configuration for
                                               // OUTPUT8 of OUTPUT-XBAR
#define XBAR_OUTPUT8MUX0TO15CFG_MUX14_S  28U
#define XBAR_OUTPUT8MUX0TO15CFG_MUX14_M  0x30000000U  // Mux14 Configuration for
                                               // OUTPUT8 of OUTPUT-XBAR
#define XBAR_OUTPUT8MUX0TO15CFG_MUX15_S  30U
#define XBAR_OUTPUT8MUX0TO15CFG_MUX15_M  0xC0000000U  // Mux15 Configuration for
                                               // OUTPUT8 of OUTPUT-XBAR

//*****************************************************************************
//
// The following are defines for the bit fields in the OUTPUT8MUX16TO31CFG register
//
//*****************************************************************************
#define XBAR_OUTPUT8MUX16TO31CFG_MUX16_S  0U
#define XBAR_OUTPUT8MUX16TO31CFG_MUX16_M  0x3U         // Mux16 Configuration for
                                               // OUTPUT8 of OUTPUT-XBAR
#define XBAR_OUTPUT8MUX16TO31CFG_MUX17_S  2U
#define XBAR_OUTPUT8MUX16TO31CFG_MUX17_M  0xCU         // Mux17 Configuration for
                                               // OUTPUT8 of OUTPUT-XBAR
#define XBAR_OUTPUT8MUX16TO31CFG_MUX18_S  4U
#define XBAR_OUTPUT8MUX16TO31CFG_MUX18_M  0x30U        // Mux18 Configuration for
                                               // OUTPUT8 of OUTPUT-XBAR
#define XBAR_OUTPUT8MUX16TO31CFG_MUX19_S  6U
#define XBAR_OUTPUT8MUX16TO31CFG_MUX19_M  0xC0U        // Mux19 Configuration for
                                               // OUTPUT8 of OUTPUT-XBAR
#define XBAR_OUTPUT8MUX16TO31CFG_MUX20_S  8U
#define XBAR_OUTPUT8MUX16TO31CFG_MUX20_M  0x300U       // Mux20 Configuration for
                                               // OUTPUT8 of OUTPUT-XBAR
#define XBAR_OUTPUT8MUX16TO31CFG_MUX21_S  10U
#define XBAR_OUTPUT8MUX16TO31CFG_MUX21_M  0xC00U       // Mux21 Configuration for
                                               // OUTPUT8 of OUTPUT-XBAR
#define XBAR_OUTPUT8MUX16TO31CFG_MUX22_S  12U
#define XBAR_OUTPUT8MUX16TO31CFG_MUX22_M  0x3000U      // Mux22 Configuration for
                                               // OUTPUT8 of OUTPUT-XBAR
#define XBAR_OUTPUT8MUX16TO31CFG_MUX23_S  14U
#define XBAR_OUTPUT8MUX16TO31CFG_MUX23_M  0xC000U      // Mux23 Configuration for
                                               // OUTPUT8 of OUTPUT-XBAR
#define XBAR_OUTPUT8MUX16TO31CFG_MUX24_S  16U
#define XBAR_OUTPUT8MUX16TO31CFG_MUX24_M  0x30000U     // Mux24 Configuration for
                                               // OUTPUT8 of OUTPUT-XBAR
#define XBAR_OUTPUT8MUX16TO31CFG_MUX25_S  18U
#define XBAR_OUTPUT8MUX16TO31CFG_MUX25_M  0xC0000U     // Mux25 Configuration for
                                               // OUTPUT8 of OUTPUT-XBAR
#define XBAR_OUTPUT8MUX16TO31CFG_MUX26_S  20U
#define XBAR_OUTPUT8MUX16TO31CFG_MUX26_M  0x300000U    // Mux26 Configuration for
                                               // OUTPUT8 of OUTPUT-XBAR
#define XBAR_OUTPUT8MUX16TO31CFG_MUX27_S  22U
#define XBAR_OUTPUT8MUX16TO31CFG_MUX27_M  0xC00000U    // Mux27 Configuration for
                                               // OUTPUT8 of OUTPUT-XBAR
#define XBAR_OUTPUT8MUX16TO31CFG_MUX28_S  24U
#define XBAR_OUTPUT8MUX16TO31CFG_MUX28_M  0x3000000U   // Mux28 Configuration for
                                               // OUTPUT8 of OUTPUT-XBAR
#define XBAR_OUTPUT8MUX16TO31CFG_MUX29_S  26U
#define XBAR_OUTPUT8MUX16TO31CFG_MUX29_M  0xC000000U   // Mux29 Configuration for
                                               // OUTPUT8 of OUTPUT-XBAR
#define XBAR_OUTPUT8MUX16TO31CFG_MUX30_S  28U
#define XBAR_OUTPUT8MUX16TO31CFG_MUX30_M  0x30000000U  // Mux30 Configuration for
                                               // OUTPUT8 of OUTPUT-XBAR
#define XBAR_OUTPUT8MUX16TO31CFG_MUX31_S  30U
#define XBAR_OUTPUT8MUX16TO31CFG_MUX31_M  0xC0000000U  // Mux31 Configuration for
                                               // OUTPUT8 of OUTPUT-XBAR

//*****************************************************************************
//
// The following are defines for the bit fields in the OUTPUT1MUXENABLE register
//
//*****************************************************************************
#define XBAR_OUTPUT1MUXENABLE_MUX0  0x1U         // Mux0 to drive OUTPUT1 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT1MUXENABLE_MUX1  0x2U         // Mux1 to drive OUTPUT1 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT1MUXENABLE_MUX2  0x4U         // Mux2 to drive OUTPUT1 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT1MUXENABLE_MUX3  0x8U         // Mux3 to drive OUTPUT1 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT1MUXENABLE_MUX4  0x10U        // Mux4 to drive OUTPUT1 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT1MUXENABLE_MUX5  0x20U        // Mux5 to drive OUTPUT1 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT1MUXENABLE_MUX6  0x40U        // Mux6 to drive OUTPUT1 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT1MUXENABLE_MUX7  0x80U        // Mux7 to drive OUTPUT1 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT1MUXENABLE_MUX8  0x100U       // Mux8 to drive OUTPUT1 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT1MUXENABLE_MUX9  0x200U       // Mux9 to drive OUTPUT1 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT1MUXENABLE_MUX10  0x400U       // Mux10 to drive OUTPUT1 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT1MUXENABLE_MUX11  0x800U       // Mux11 to drive OUTPUT1 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT1MUXENABLE_MUX12  0x1000U      // Mux12 to drive OUTPUT1 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT1MUXENABLE_MUX13  0x2000U      // Mux13 to drive OUTPUT1 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT1MUXENABLE_MUX14  0x4000U      // Mux14 to drive OUTPUT1 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT1MUXENABLE_MUX15  0x8000U      // Mux15 to drive OUTPUT1 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT1MUXENABLE_MUX16  0x10000U     // Mux16 to drive OUTPUT1 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT1MUXENABLE_MUX17  0x20000U     // Mux17 to drive OUTPUT1 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT1MUXENABLE_MUX18  0x40000U     // Mux18 to drive OUTPUT1 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT1MUXENABLE_MUX19  0x80000U     // Mux19 to drive OUTPUT1 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT1MUXENABLE_MUX20  0x100000U    // Mux20 to drive OUTPUT1 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT1MUXENABLE_MUX21  0x200000U    // Mux21 to drive OUTPUT1 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT1MUXENABLE_MUX22  0x400000U    // Mux22 to drive OUTPUT1 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT1MUXENABLE_MUX23  0x800000U    // Mux23 to drive OUTPUT1 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT1MUXENABLE_MUX24  0x1000000U   // Mux24 to drive OUTPUT1 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT1MUXENABLE_MUX25  0x2000000U   // Mux25 to drive OUTPUT1 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT1MUXENABLE_MUX26  0x4000000U   // Mux26 to drive OUTPUT1 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT1MUXENABLE_MUX27  0x8000000U   // Mux27 to drive OUTPUT1 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT1MUXENABLE_MUX28  0x10000000U  // Mux28 to drive OUTPUT1 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT1MUXENABLE_MUX29  0x20000000U  // Mux29 to drive OUTPUT1 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT1MUXENABLE_MUX30  0x40000000U  // Mux30 to drive OUTPUT1 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT1MUXENABLE_MUX31  0x80000000U  // Mux31 to drive OUTPUT1 of
                                               // OUTPUT-XBAR

