liyugoodboy/serialFlashProgrammer/SciFlashAppCpu1_TMS320F28379D/library/driverlib/inc/hw_outputxbar.h
//*****************************************************************************
//
// The following are defines for the bit fields in the OUTPUT7MUXENABLE register
//
//*****************************************************************************
#define XBAR_OUTPUT7MUXENABLE_MUX0  0x1U         // Mux0 to drive OUTPUT7 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT7MUXENABLE_MUX1  0x2U         // Mux1 to drive OUTPUT7 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT7MUXENABLE_MUX2  0x4U         // Mux2 to drive OUTPUT7 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT7MUXENABLE_MUX3  0x8U         // Mux3 to drive OUTPUT7 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT7MUXENABLE_MUX4  0x10U        // Mux4 to drive OUTPUT7 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT7MUXENABLE_MUX5  0x20U        // Mux5 to drive OUTPUT7 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT7MUXENABLE_MUX6  0x40U        // Mux6 to drive OUTPUT7 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT7MUXENABLE_MUX7  0x80U        // Mux7 to drive OUTPUT7 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT7MUXENABLE_MUX8  0x100U       // Mux8 to drive OUTPUT7 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT7MUXENABLE_MUX9  0x200U       // Mux9 to drive OUTPUT7 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT7MUXENABLE_MUX10  0x400U       // Mux10 to drive OUTPUT7 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT7MUXENABLE_MUX11  0x800U       // Mux11 to drive OUTPUT7 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT7MUXENABLE_MUX12  0x1000U      // Mux12 to drive OUTPUT7 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT7MUXENABLE_MUX13  0x2000U      // Mux13 to drive OUTPUT7 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT7MUXENABLE_MUX14  0x4000U      // Mux14 to drive OUTPUT7 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT7MUXENABLE_MUX15  0x8000U      // Mux15 to drive OUTPUT7 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT7MUXENABLE_MUX16  0x10000U     // Mux16 to drive OUTPUT7 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT7MUXENABLE_MUX17  0x20000U     // Mux17 to drive OUTPUT7 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT7MUXENABLE_MUX18  0x40000U     // Mux18 to drive OUTPUT7 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT7MUXENABLE_MUX19  0x80000U     // Mux19 to drive OUTPUT7 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT7MUXENABLE_MUX20  0x100000U    // Mux20 to drive OUTPUT7 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT7MUXENABLE_MUX21  0x200000U    // Mux21 to drive OUTPUT7 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT7MUXENABLE_MUX22  0x400000U    // Mux22 to drive OUTPUT7 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT7MUXENABLE_MUX23  0x800000U    // Mux23 to drive OUTPUT7 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT7MUXENABLE_MUX24  0x1000000U   // Mux24 to drive OUTPUT7 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT7MUXENABLE_MUX25  0x2000000U   // Mux25 to drive OUTPUT7 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT7MUXENABLE_MUX26  0x4000000U   // Mux26 to drive OUTPUT7 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT7MUXENABLE_MUX27  0x8000000U   // Mux27 to drive OUTPUT7 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT7MUXENABLE_MUX28  0x10000000U  // Mux28 to drive OUTPUT7 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT7MUXENABLE_MUX29  0x20000000U  // Mux29 to drive OUTPUT7 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT7MUXENABLE_MUX30  0x40000000U  // Mux30 to drive OUTPUT7 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT7MUXENABLE_MUX31  0x80000000U  // Mux31 to drive OUTPUT7 of
                                               // OUTPUT-XBAR

//*****************************************************************************
//
// The following are defines for the bit fields in the OUTPUT8MUXENABLE register
//
//*****************************************************************************
#define XBAR_OUTPUT8MUXENABLE_MUX0  0x1U         // Mux0 to drive OUTPUT8 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT8MUXENABLE_MUX1  0x2U         // Mux1 to drive OUTPUT8 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT8MUXENABLE_MUX2  0x4U         // Mux2 to drive OUTPUT8 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT8MUXENABLE_MUX3  0x8U         // Mux3 to drive OUTPUT8 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT8MUXENABLE_MUX4  0x10U        // Mux4 to drive OUTPUT8 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT8MUXENABLE_MUX5  0x20U        // Mux5 to drive OUTPUT8 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT8MUXENABLE_MUX6  0x40U        // Mux6 to drive OUTPUT8 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT8MUXENABLE_MUX7  0x80U        // Mux7 to drive OUTPUT8 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT8MUXENABLE_MUX8  0x100U       // Mux8 to drive OUTPUT8 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT8MUXENABLE_MUX9  0x200U       // Mux9 to drive OUTPUT8 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT8MUXENABLE_MUX10  0x400U       // Mux10 to drive OUTPUT8 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT8MUXENABLE_MUX11  0x800U       // Mux11 to drive OUTPUT8 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT8MUXENABLE_MUX12  0x1000U      // Mux12 to drive OUTPUT8 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT8MUXENABLE_MUX13  0x2000U      // Mux13 to drive OUTPUT8 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT8MUXENABLE_MUX14  0x4000U      // Mux14 to drive OUTPUT8 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT8MUXENABLE_MUX15  0x8000U      // Mux15 to drive OUTPUT8 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT8MUXENABLE_MUX16  0x10000U     // Mux16 to drive OUTPUT8 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT8MUXENABLE_MUX17  0x20000U     // Mux17 to drive OUTPUT8 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT8MUXENABLE_MUX18  0x40000U     // Mux18 to drive OUTPUT8 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT8MUXENABLE_MUX19  0x80000U     // Mux19 to drive OUTPUT8 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT8MUXENABLE_MUX20  0x100000U    // Mux20 to drive OUTPUT8 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT8MUXENABLE_MUX21  0x200000U    // Mux21 to drive OUTPUT8 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT8MUXENABLE_MUX22  0x400000U    // Mux22 to drive OUTPUT8 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT8MUXENABLE_MUX23  0x800000U    // Mux23 to drive OUTPUT8 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT8MUXENABLE_MUX24  0x1000000U   // Mux24 to drive OUTPUT8 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT8MUXENABLE_MUX25  0x2000000U   // Mux25 to drive OUTPUT8 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT8MUXENABLE_MUX26  0x4000000U   // Mux26 to drive OUTPUT8 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT8MUXENABLE_MUX27  0x8000000U   // Mux27 to drive OUTPUT8 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT8MUXENABLE_MUX28  0x10000000U  // Mux28 to drive OUTPUT8 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT8MUXENABLE_MUX29  0x20000000U  // Mux29 to drive OUTPUT8 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT8MUXENABLE_MUX30  0x40000000U  // Mux30 to drive OUTPUT8 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUT8MUXENABLE_MUX31  0x80000000U  // Mux31 to drive OUTPUT8 of
                                               // OUTPUT-XBAR

//*****************************************************************************
//
// The following are defines for the bit fields in the OUTPUTLATCH register
//
//*****************************************************************************
#define XBAR_OUTPUTLATCH_OUTPUT1  0x1U         // Records the OUTPUT1 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUTLATCH_OUTPUT2  0x2U         // Records the OUTPUT2 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUTLATCH_OUTPUT3  0x4U         // Records the OUTPUT3 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUTLATCH_OUTPUT4  0x8U         // Records the OUTPUT4 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUTLATCH_OUTPUT5  0x10U        // Records the OUTPUT5 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUTLATCH_OUTPUT6  0x20U        // Records the OUTPUT6 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUTLATCH_OUTPUT7  0x40U        // Records the OUTPUT7 of
                                               // OUTPUT-XBAR
#define XBAR_OUTPUTLATCH_OUTPUT8  0x80U        // Records the OUTPUT8 of
                                               // OUTPUT-XBAR

//*****************************************************************************
//
// The following are defines for the bit fields in the OUTPUTLATCHCLR register
//
//*****************************************************************************
#define XBAR_OUTPUTLATCHCLR_OUTPUT1  0x1U         // Clears the Output-Latch for
                                               // OUTPUT1 of OUTPUT-XBAR
#define XBAR_OUTPUTLATCHCLR_OUTPUT2  0x2U         // Clears the Output-Latch for
                                               // OUTPUT2 of OUTPUT-XBAR
#define XBAR_OUTPUTLATCHCLR_OUTPUT3  0x4U         // Clears the Output-Latch for
                                               // OUTPUT3 of OUTPUT-XBAR
#define XBAR_OUTPUTLATCHCLR_OUTPUT4  0x8U         // Clears the Output-Latch for
                                               // OUTPUT4 of OUTPUT-XBAR
#define XBAR_OUTPUTLATCHCLR_OUTPUT5  0x10U        // Clears the Output-Latch for
                                               // OUTPUT5 of OUTPUT-XBAR
#define XBAR_OUTPUTLATCHCLR_OUTPUT6  0x20U        // Clears the Output-Latch for
                                               // OUTPUT6 of OUTPUT-XBAR
#define XBAR_OUTPUTLATCHCLR_OUTPUT7  0x40U        // Clears the Output-Latch for
                                               // OUTPUT7 of OUTPUT-XBAR
#define XBAR_OUTPUTLATCHCLR_OUTPUT8  0x80U        // Clears the Output-Latch for
                                               // OUTPUT8 of OUTPUT-XBAR

//*****************************************************************************
//
// The following are defines for the bit fields in the OUTPUTLATCHFRC register
//
//*****************************************************************************
#define XBAR_OUTPUTLATCHFRC_OUTPUT1  0x1U         // Sets the Output-Latch for
                                               // OUTPUT1 of OUTPUT-XBAR
#define XBAR_OUTPUTLATCHFRC_OUTPUT2  0x2U         // Sets the Output-Latch for
                                               // OUTPUT2 of OUTPUT-XBAR
#define XBAR_OUTPUTLATCHFRC_OUTPUT3  0x4U         // Sets the Output-Latch for
                                               // OUTPUT3 of OUTPUT-XBAR
#define XBAR_OUTPUTLATCHFRC_OUTPUT4  0x8U         // Sets the Output-Latch for
                                               // OUTPUT4 of OUTPUT-XBAR
#define XBAR_OUTPUTLATCHFRC_OUTPUT5  0x10U        // Sets the Output-Latch for
                                               // OUTPUT5 of OUTPUT-XBAR
#define XBAR_OUTPUTLATCHFRC_OUTPUT6  0x20U        // Sets the Output-Latch for
                                               // OUTPUT6 of OUTPUT-XBAR
#define XBAR_OUTPUTLATCHFRC_OUTPUT7  0x40U        // Sets the Output-Latch for
                                               // OUTPUT7 of OUTPUT-XBAR
#define XBAR_OUTPUTLATCHFRC_OUTPUT8  0x80U        // Sets the Output-Latch for
                                               // OUTPUT8 of OUTPUT-XBAR

//*****************************************************************************
//
// The following are defines for the bit fields in the OUTPUTLATCHENABLE register
//
//*****************************************************************************
#define XBAR_OUTPUTLATCHENABLE_OUTPUT1  0x1U         // Selects the output latch to
                                               // drive OUTPUT1 for OUTPUT-XBAR
#define XBAR_OUTPUTLATCHENABLE_OUTPUT2  0x2U         // Selects the output latch to
                                               // drive OUTPUT2 for OUTPUT-XBAR
#define XBAR_OUTPUTLATCHENABLE_OUTPUT3  0x4U         // Selects the output latch to
                                               // drive OUTPUT3 for OUTPUT-XBAR
#define XBAR_OUTPUTLATCHENABLE_OUTPUT4  0x8U         // Selects the output latch to
                                               // drive OUTPUT4 for OUTPUT-XBAR
#define XBAR_OUTPUTLATCHENABLE_OUTPUT5  0x10U        // Selects the output latch to
                                               // drive OUTPUT5 for OUTPUT-XBAR
#define XBAR_OUTPUTLATCHENABLE_OUTPUT6  0x20U        // Selects the output latch to
                                               // drive OUTPUT6 for OUTPUT-XBAR
#define XBAR_OUTPUTLATCHENABLE_OUTPUT7  0x40U        // Selects the output latch to
                                               // drive OUTPUT7 for OUTPUT-XBAR
#define XBAR_OUTPUTLATCHENABLE_OUTPUT8  0x80U        // Selects the output latch to
                                               // drive OUTPUT8 for OUTPUT-XBAR

//*****************************************************************************
//
// The following are defines for the bit fields in the OUTPUTINV register
//
//*****************************************************************************
#define XBAR_OUTPUTINV_OUTPUT1    0x1U         // Selects polarity for OUTPUT1
                                               // of OUTPUT-XBAR
#define XBAR_OUTPUTINV_OUTPUT2    0x2U         // Selects polarity for OUTPUT2
                                               // of OUTPUT-XBAR
#define XBAR_OUTPUTINV_OUTPUT3    0x4U         // Selects polarity for OUTPUT3
                                               // of OUTPUT-XBAR
#define XBAR_OUTPUTINV_OUTPUT4    0x8U         // Selects polarity for OUTPUT4
                                               // of OUTPUT-XBAR
#define XBAR_OUTPUTINV_OUTPUT5    0x10U        // Selects polarity for OUTPUT5
                                               // of OUTPUT-XBAR
#define XBAR_OUTPUTINV_OUTPUT6    0x20U        // Selects polarity for OUTPUT6
                                               // of OUTPUT-XBAR
#define XBAR_OUTPUTINV_OUTPUT7    0x40U        // Selects polarity for OUTPUT7
                                               // of OUTPUT-XBAR
#define XBAR_OUTPUTINV_OUTPUT8    0x80U        // Selects polarity for OUTPUT8
                                               // of OUTPUT-XBAR

//*****************************************************************************
//
// The following are defines for the bit fields in the OUTPUTLOCK register
//
//*****************************************************************************
#define XBAR_OUTPUTLOCK_LOCK      0x1U         // Locks the configuration for
                                               // OUTPUT-XBAR
#define XBAR_OUTPUTLOCK_KEY_S     16U
#define XBAR_OUTPUTLOCK_KEY_M     0xFFFF0000U  // Write Protection KEY
#endif
